Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: Signing and verifying is done using the Elliptic Curve Digital Signature Algorithm (ECDSA).
ja: 楕円曲線デジタル署名アルゴリズム (ECDSA) を用いて署名と検証が行なわれる.

source: Adding new reservations requires IETF consensus [4].
ja: 他の予約を追加するには IETF の合意が必要だ [4].

source: If the random data here (e.g., Diffie- Hellman (DH) parameters) are pseudo-random, then the pseudo-random number generator should be cryptographically secure (i.e., its next output not easily guessed even when knowing all previous outputs) and, furthermore, proper entropy needs to be added to the pseudo- random number generator.
ja: もし, ここで乱数(たとえば, Diffie-Hellman (DH) のパラメータ) が擬似乱数ならば, 擬似乱数生成器は暗号学的に安全でなければならない. (すなわち, 生成器の次の出力が, たとえ以前の出力をすべて知られていても, 簡単に推測されない) さらに, 適切なエントロピーが疑似乱数生成器に追加される必要がある.

source: In other cases, the user name may not be verified by the server, so for these implementations, it may be necessary to obtain the user name from other credentials exchanged during the SSH exchange.
ja: 別の場合として, ユーザ名がサーバによって検証されない可能性がある. そのような実装のため, SSHの交換の間に交換される他の資格情報からユーザ名を得る必要があるかもしれない.

source: Note that the value for the 'data_type_code' is given in decimal format for readability, but the values are actually uint32 values.
ja: 'data_type_code' は読み易いように10進のフォーマットで書かれているが, 実際にはuint32の値であることに注意.

source: Because of possible information leakage through the MAC tag, SSH implementations SHOULD rekey at least once every 2**32 outgoing packets.
ja: MACタグから情報漏洩する可能性があるため, 少なくとも 2**32 のパケット発信ごとにSSHの実装は鍵の再生成をする必要がある.

source: Such lines MAY be silently ignored, or MAY be displayed to the client user.
ja: それぞれの行は静かに無視されてもよいし, クライアントユーザに表示されてもよい.

source: In practice however, it is RECOMMENDED that the compression method be the same in both directions.
ja: しかしながら実際上は, どちらの方向でも同じ圧縮アルゴリズムを用いることが推奨される.

source: To protect against this, a final message is sent by the client to indicate it has completed authentication.
ja: これを防ぐため, クライアントは認証が完了した事を示す最後のメッセージを送る.

source: The user name must be encoded in UTF-8 (per [RFC4252]).
ja: ユーザ名は UTF-8 でエンコードされなければならない ([RFC4252] による).

source: Security Considerations .......................................28 15.
ja: セキュリティの考察......................................28 15.

source: At some point in the processing, these mechanisms require the password to be made available as cleartext on the device that is authenticating the password, which might introduce threats to the authentication infrastructure.
ja: 処理のある時点で, これらのメカニズムは, パスワードを認証するためにパスワードをデバイス上で平文で利用する必要がある. これは認証基盤への脅威を招くかもしれない.

source: The SSH framework requires that the shared key be an integer.
ja: SSHのフレームワークでは, 共有鍵が整数でなければならない.

source: This document defines two new key exchange methods: "diffie-hellman-group-exchange-sha1" and "diffie-hellman-group-exchange-sha256".
ja: この文書は 新しい2つの鍵交換法を定義する: "diffie-hellman-group-exchange-sha1" と "diffie-hellman-group-exchange-sha256" だ.

source: Multiple channels are multiplexed into a single connection.
ja: 複数のチャンネルは, 単一の接続に多重化される.

source: In addition to the attributes specified by the client, the server MAY provide a method for administrators to enforce certain attributes compulsorily.
ja: クライアントで指定された属性に加えて特定の属性を強制するための, 管理者用の方法をサーバは提供してもよい.

source: The key exchange to be used in Secure Shell is determined by the name lists exchanged in the SSH_MSG_KEXINIT packets.
ja: セキュアシェルで用いられる鍵交換は, SSH_MSG_KEXINIT パケットで交換される name-list で決定される.

source: The following table lists the initial assignments of the Connection Protocol Channel Types.
ja: 次の表で, コネクションプロトコルのチャンネルのタイプの初期の割り当てを示す.

source: Data sent by the NETCONF client are marked with "C:", and data sent by the NETCONF server are marked with "S:".
ja: NETCONF クライアントから送られるメッセージには "C:" を, NETCONF サーバから送られるメッセージには "S:" を付けている.

source: It is expected that an entity implementing this MIB will also support the Transport Security Model [RFC5591] and, therefore, implement the SNMP-TSM-MIB.
ja: この MIB を実装する エンティティは, Transport Security Model [RFC5591] もサポートし, そのために SNMP-TSM-MIB を実装することが期待される.

source: Similarly, when using ecdh_sha2_nistp384, each exponent used in the key exchange must have 384 bits of entropy.
ja: ecdh_sha2_nistp384 を用いる場合, 鍵交換時に利用するそれぞれの指数は 384 ビットのエントロピーを持たなければならない.

source: 75 ONLRET Newline performs a carriage return (output).
ja: 75 ONLRET 出力で, NLがCRを実行する.

source: Generic GSS-API Key Exchange
ja: 汎用 GSS-API 鍵交換

source: Although this document gives specific examples of how NETCONF messages are sent over an SSH connection, use of this transport is not restricted to the messages shown in the examples below.
ja: この文書は NETCONF メッセージが SSH 接続上でどのように送られるかの具体例を与えるが, このトランスポートの利用は以下の例で示すメッセージに制限されない.

source: Conventions Used in This Document
ja: この文書で用いる表記

source: See [RFC4086] for recommendations on random number generation.
ja: 乱数の生成の推奨については [RFC4086] を参照.

source: The "aes256-cbc" cipher is AES (Advanced Encryption Standard) [FIPS-197], in CBC mode.
ja: "aes256-cbc" 暗号は, CBCモードの AES (Advanced Encryption Standard) [FIPS-197] だ.

source: The client SHOULD NOT try this method more than once per session.
ja: クライアントは1セッションに2回以上この方法を試さないほうがよい.

source: Generate and sign exchange hash.
ja: 交換ハッシュの生成と署名

source: Key Re-Exchange
ja: 鍵の再交換

source: Connection Protocol Subsystem Names ................15 4.10.
ja: コネクションプロトコルのサブシステムの名前.......15 4.10.

source: Private Use Headers
ja: 私的利用のヘッダ

source: To continue the example given above, an NETCONF over SSH session to retrieve a set of configuration information might look like this:
ja: 上記の例に続いて, 設定情報の集合を取得する SSH セッション上の NETCONF は次のようになる:

source: If this information is unavailable, the authentication MUST fail.
ja: この情報が利用できなければ, 認証は失敗しなければならない.

source: Elliptic Curve Digital Signature Algorithm .........11 6.3.
ja: 楕円曲線 Digital Signature Algorithm .........11 6.3.

source: This keystream is produced by encrypting the following 16-octet data structure:
ja: この鍵ストリームは, 以下の 16-オクテットのデータ構造を暗号化して生成される.

source: Implementations may choose to instantiate SSH sessions in anticipation of outgoing messages.
ja: 実装は, 送信メッセージを予想して SSH のセッションを開始することを選んでもよい.

source: Completion of User Authentication ..........................7 5.4.
ja: ユーザ認証の完了 ..........................7 5.4.

source: If the RSA private key generated by the server is revealed, then the session key is revealed.
ja: サーバで生成された RSA 秘密鍵が漏れたら, セッション鍵も漏れる.

source: GSS-API User Authentication ....................................13 3.1.
ja: GSS-API ユーザ認証 ....................................13 3.1.

source: The Secure Shell protocol provides support for encryption and data integrity.
ja: セキュアシェルプロトコルは, 暗号化とデータの完全性のサポートを提供する.

source: One of the algorithms specified in the base protocol is "arcfour", which specifies the use of Arcfour (also known as RC4), a fast stream cipher.
ja: 基底のプロトコルで指定されたアルゴリズムの1つが "arcfour" で, 高速なストリーム暗号である Arcfour (RC4としても知られる) を利用するよう指定されている.

source: Such a generator is called a "primitive root" (which is trivial to find when p is "safe").
ja: このような生成器は "原始根" と呼ばれる （ｐが"安全"なときは容易に見つけられる).

source: kex algorithms ecdh-sha2-nistp256 [SSH-ECC] ecdh-sha2-nistp384 [SSH-ECC]
ja: 鍵交換アルゴリズム ecdh-sha2-nistp256 [SSH-ECC] ecdh-sha2-nistp384 [SSH-ECC]

source: o Algorithm negotiation messages (20 to 29) (but further SSH_MSG_KEXINIT messages MUST NOT be sent);
ja: o アルゴリズムネゴシエーションメッセージ (20 to 29) (しかし, さらなる SSH_MSG_KEXINIT メッセージは送ってはならない);

source: * For these RECOMMENDED curves, the elliptic curve domain parameter identifier is the string in the third column of the table, the ASCII representation of the OID of the curve.
ja: * これらの推奨の曲線では, 楕円曲線ドメインパラメータ識別子は, この表の3番目のカラムの文字列, 曲線のOIDのASCII表現だ.

source: Implementation of this specification requires familiarity with the Secure Shell protocol [RFC4251] [RFC4253] and X.509v3 certificates [RFC5280].
ja: この仕様の実装は, セキュアシェルプロトコル [RFC4251] [RFC4253] と X.509v3 証明書 [RFC5280] に精通している必要がある.

source: A public key may also be associated with various restrictions, including a mandatory command or subsystem.
ja: 公開鍵を, コマンドやサブシステムの強制を含む様々な制限に関連付けることができる.

source: This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements.
ja: この文書は, インターネットコミュニティに対するインターネットの標準トラックプロトコルを定義している. また, 改善のための議論と示唆を求めている

source: SSH works over any 8-bit clean, binary-transparent transport.
ja: SSH は, 8-bit クリーンでバイナリ透過などんなトランスポート上でも動作する.

source: The key exchange is combined with a signature with the host key to provide host authentication.
ja: この鍵交換は, ホスト認証を提供するホスト鍵による署名と結合している.

source: Each of these methods specifies GSS-API-authenticated Diffie-Hellman key exchange as described in Section 2.1 with SHA-1 as HASH, and the group defined in Section 8.1 of [SSH-TRANSPORT].
ja: この種類のメソッドのそれぞれは， 2．1 節で記述した SHA-1をHASHとするGSS-APIで認証される Diffie-Hellman 鍵交換 と [SSH-TRANSPORT]の8．1節で定義した群を指定します．

source: Implementations SHOULD preserve such unrecognized headers when manipulating the key file.
ja: 鍵ファイルを操作する際は, そのような認識できないヘッダを実装は保存する必要がある.

source: Replay
ja: リプレイ(再送)

source: o Encoding of signatures and/or encrypted data.
ja: o 署名のエンコーディングと/ないし暗号化されたデータ.

source: While SSH does support turning off confidentiality and integrity, they MUST NOT be turned off when used with the SSH Transport Model.
ja: SSH は機密性と完全性を無効にすることをサポートしているが, SSHトランスポートモデルで利用する場合はこれらを無効にしてはならない.

source: It computes K = e^y mod p, H = hash(V_C || V_S || I_C || I_S || K_S || min || n || max || p || g || e || f || K) (these elements are encoded according to their types; see below), and signature s on H with its private host key.
ja: K = e^y mod p と H = hash(V_C || V_S || I_C || I_S || K_S || min || n || max || p || g || e || f || K) (これらの要素はタイプに従ってエンコードされている. 以下を参照) を計算し, ホスト秘密鍵で H に署名し s を得る.

source: All of the RECOMMENDED curves in Section 10 do not have this problem.
ja: 10節でのすべての推奨の曲線には, この問題はない.

source: An implementation MUST respond to all unrecognized messages with an SSH_MSG_UNIMPLEMENTED message in the order in which the messages were received.
ja: すべての実装は, すべての認識できないメッセージに対して受け取った順にSSH_MSG_UNIMPLEMENTED メッセージで応答しなければならない.

source: 91 CS8 8 bit mode.
ja: 91 CS8 8 bit モード.

source: Local extensions:
ja: ローカルな拡張:

source: Appendix A. Changes from RFC 4742
ja: Appendix A. RFC 4742 からの変更点

source: Ordering of Key Exchange Methods
ja: 鍵交換法の注文

source: All such requests use the following format.
ja: それらの要求はすべて次のフォーマットに従う.

source: opcode mnemonic description ------ -------- ----------- 0 TTY_OP_END Indicates end of options.
ja: オペコード mnemonic 説明 ------ -------- ----------- 0 TTY_OP_END オプションの終りを示す.

source: "from" specifies a comma-separated list of hosts from which the key may be used.
ja: "from" は 鍵がそこから使われるホストのカンマ区切りリストを指定する.

source: If the client receives this message after a call to GSS_Init_sec_context() has returned a major_status code of GSS_S_COMPLETE, a protocol error has occurred and the key exchange MUST fail.
ja: GSS_Init_sec_context() が major_status コードとして GSS_S_COMPLETE を返したあとでこのメッセージをクライアントが受けとったならば, プロトコルエラーが起きており鍵交換は失敗しなければならない.

source: However, if it wishes that connections to a port on the other side be forwarded to the local side, it must explicitly request this.
ja: しかし, 相手側のポートへの接続をローカル側に転送したいと望むならば明示的に要求しなければならない.

source: The SSH protocol has its own window mechanism, defined in RFC 4254.
ja: SSH は 独自の window メカニズムを持っており, RFC 4254 で定義されている.

source: Based on the previous version of this document, RFC 4742, IANA assigned the TCP port 830 as the default port for NETCONF over SSH sessions.
ja: この文書の以前のバージョン, RFC 4742 に基づき, IANA は SSH セッション上の NETCONF のデフォルトのポートとして TCP ポート 830 番を割り当てた.

source: Security Mechanism Negotiation and Initialization ...............6 3.1.
ja: セキュリティメカニズムの交渉と初期化 ...............6 3.1.

source: Key usage may also be restricted by policy statements (e.g., in certificates).
ja: 鍵の利用法は, (たとえば証明書の中での)ポリシーの記述によって制限されるかもしれない.

source: Many of these issues may involve traversing or bypassing firewalls, and are interrelated with the local security policy.
ja: これらの問題の多くが, ファイアウォールの横断や回避に関与しており, ローカルなセキュリティポリシーと関連している.

source: The key exchange method defined by this document uses explicit server authentication.
ja: この文書で定義される鍵交換法は明示的なサーバ認証を用いる.

source: However, if it is used, it MAY be used either on its own or in conjunction with TransportAddressType or TransportDomain as a pair.
ja: しかし, これが用いられる場合, それ自身ないし TransportAddressType や TransportDomain とペアとして組み合わされて利用されてもよい.

source: Debug Message
ja: デバッグメッセージ

source: Thus, this protocol assumes that it is externally protected from network-level attacks.
ja: つまり, このプロトコルは, ネットワークレベルの攻撃からは非常に保護されていることを前提としている.

source: o Names that do not contain an at-sign ("@") are reserved to be assigned by IETF CONSENSUS.
ja: o アットマーク "@" を含まない名前は, IETFの合意によって割当てられるために予約されている.

source: The transport layer of SSH provides confidentiality for password authentication and other methods that rely on secret data.
ja: SSHのトランスポート層は, 秘密のデータに依存するパスワード認証や他の方法のための機密性を提供する.

source: NETCONF is defined to be session-layer and transport independent, allowing mappings to be defined for multiple session-layer or transport protocols.
ja: NETCONF は セッション層とトランスポート独立に定義されており, 複数のセッション層とトランスポートプロトコルへのマッピングが可能だ.

source: Data Integrity
ja: データの完全性

source: Framing Protocol
ja: フレーミングプロトコル

source: The Secure Shell Protocol
ja: セキュアシェルプロトコル

source: Fingerprint Matching
ja: 指紋の一致

source: It is possible to hand a password to a service such as RADIUS [RFC2865] or Diameter [RFC3588] for validation.
ja: 検証のために, RADIUS [RFC2864] や Diameter [RFC3588] のようなサービスにパスワードを渡すことが可能だ.

source: The body of a public key file is the base64 encoded ([RFC2045]) public key data as specified by [RFC4253], Section 6.6:
ja: 公開鍵ファイルの本体は, [RFC4253]の6.6節で指定された公開鍵データを base64 エンコード ([RFC2045]) したものだ.

source: Thus, it is RECOMMENDED that implementations provide a means for controlling, as a matter of policy, whether to send SSH_MSG_USERAUTH_GSSAPI_ERROR, SSH_MSG_USERAUTH_GSSAPI_ERRTOK, and SSH_MSG_KEXGSS_ERROR messages, and SSH_MSG_KEXGSS_CONTINUE messages containing a GSS-API error token.
ja: このため,SSH_MSG_USERAUTH_GSSAPI_ERROR と SSH_MSG_USERAUTH_GSSAPI_ERRTOK, SSH_MSG_KEXGSS_ERROR, GSS-API エラートークンを含む SSH_MSG_KEXGSS_CONTINUE メッセージを送るかどうかを ポリシーの問題として制御する手段を実装が提供することが推奨される.

source: It must be stressed that the chances of such an occurrence are, needless to say, minimal when using modern cryptographic methods.
ja: 現代の暗号技術を利用していればこのようなことが起こる可能性は, 言うまでもなく, ほとんどないことを強調しておく.

source: If 'always_display' is TRUE, the message SHOULD be displayed.
ja: 'always_display' が TRUE なら, メッセージを表示する必要がある.

source: The initial value of the invocation counter is determined by the SSH initialization vector.
ja: 呼び出しカウンタの初期値は, SSH 初期化ベクトルで決定される.

source: Client Server ------ ------ TCP(seq=x, len=500) ----> contains Record 1
ja: Client Server ------ ------ TCP(seq=x, len=500) ----> Record 1 を含む

source: This protocol binds each session key to the session by including random, session specific data in the hash used to produce session keys.
ja: このプロトコルは, セッション鍵を作成するのに使われるハッシュの中にランダムでセッション固有のデータを含むことで, セッション鍵をセッションに束縛する.

source: Use over TCP/IP ............................................4 4.2.
ja: TCP/IP上での利用.......................................4 4.2.

source: At the 192-bit minimum level of security:
ja: 192ビットのセキュリティ最小レベルの場合:

source: When this message is received, the new keys and algorithms MUST be used for receiving.
ja: このメッセージを受け取ったら, 新しい鍵とアルゴリズムを受信に利用しなければならない.

source: 54 ECHOE Visually erase chars.
ja: 54 ECHOE 視覚的なerase文字

source: Size of the Authentication Tag
ja: 認証タグのサイズ

source: Distribution of this memo is unlimited.
ja: このメモの配布は制限しない.

source: ECC Public Key Algorithm (ecdsa-sha2-*) ...................11 6.2.1.
ja: 楕円曲線暗号公開鍵アルゴリズム (ecdsa-sha2-*) ...................11 6.2.1.

source: C then computes K = f^x mod p, H = hash(V_C || V_S || I_C || I_S || K_S || e || f || K), and verifies the signature s on H.
ja: そして C は K = f^x mod p と H = hash(V_C || V_S || I_C || I_S || K_S || e || f || K)を計算し H に対する署名 s を検証する.

source: This document defines additional cache requirements related to the Secure Shell Transport Model.
ja: この文書は, セキュアシェルトランスポートモデルに関連するキャッシュの追加の要求を定義する.

source: Key exchange ends by each side sending an SSH_MSG_NEWKEYS message.
ja: 鍵交換は, それぞれの側が SSH_MSG_NEWKEYS メッセージを送ることで終了する.

source: SNMP Notifications are authorized to be sent to a receiver based on the securityName used by the notification originator's SNMP engine.
ja: SNMP の通知は, 通知の発信者の SNMP エンジンで用いられている securityName に基づいて受信者に対して送信する権限を与えられる.

source: The message may consist of multiple lines separated by CRLF (Carriage Return - Line Feed) pairs.
ja: このメッセージは, CRLF (キャリッジリターン - ラインフィード) のペアで分割された複数行を含むかもしれない.

source: Already successfully completed authentications SHOULD NOT be included in the name-list, unless they should be performed again for some reason.
ja: すでに認証が成功しているものは, リストに含めないほうがよい. ただし, なんらかの理由でもう一度実行すべき場合は除く.

source: The IANA will not control the message numbers in the range of 192 through 255.
ja: IANAは, 192 から 255 の範囲のメッセージ番号は制御しない.

source: As [RFC6241] states, the NETCONF client also sends an XML document containing a <hello> element to indicate the NETCONF client's capabilities to the NETCONF server.
ja: [RFC6241] で述べられているように, NETCONF クライアントも NETCONF サーバに NETCONF クライアントの機能を示すために <hello> 要素を含む XML 文書を送らなければならない.

source: For the sake of clarity, we list both names below.
ja: わかりやすくするため, 以下に両方の名前を挙げる.

source: As specified in [RFC6241], the NETCONF server indicates its capabilities by sending an XML document containing a <hello> element as soon as the NETCONF session is established.
ja: [RFC6241] で指定されているように, NETCONF サーバは, NETCONFのセッションが確立したらすぐに <hello> 要素を含む XML 文書を送ってその機能を示さなければならない.

source: They will usually, but not always, be used in a context that relates to compatibility with the RFC 3411 architecture or the subsystem defined here but that might have no impact on on-the-wire compatibility.
ja: これらは, RFC 3411 アーキテクチャやこの文書で定義するサブシステムと互換性を持つが通信の互換性になにも影響を与えない文脈で通常用いられるが, 必ずしもそうとは限らない.

source: A string containing a comma-separated list of names.
ja: カンマで区切られた name のリストを含む string.

source: Differences with RFC 1421 PEM Formats ......................4 3.6.
ja: RFC 1421 PEM 形式との違い ......................4 3.6.

source: The Secure Shell protocol provides negotiation mechanisms for public key algorithms and key exchange methods: any implementations that do not recognize the algorithms and methods defined in this document will ignore them in the negotiation and use the next mutually supported algorithm or method, causing no negative impact on backward compatibility.
ja: セキュアシェルプロトコルは, 公開鍵アルゴリズムと鍵交換法のネゴシエーションメカニズムを提供している: この文書で定義されているアルゴリズムや方法を認識しない実装はどれも, ネゴシエージョンでこれらを無視し相互にサポートしているアルゴリズムか方法を用いる. 後方互換性で問題となる影響は発生しない.

source: This packet SHOULD be sent immediately following receipt of the SSH_MSG_USERAUTH_GSSAPI_EXCHANGE_COMPLETE packet.
ja: SSH_MSG_USERAUTH_GSSAPI_EXCHANGE_COMPLETE パケットを受け取ったら直ちにこのパケットを送る必要がある.

source: Security Considerations .........................................8 8.1.
ja: セキュリティの考察 .........................................8 8.1.

source: However, it may be necessary in non-security-critical environments, and will still provide protection against passive attacks.
ja: しかし, これはセキュリティが重大事項ではない環境では必要であり, 受動的な攻撃に対する保護は提供する.

source: The key exchange method name defined for use with this key exchange is "ecmqv-sha2".
ja: この鍵交換法を利用するために定義された名前は, "ecmqv-sha2" だ.

source: MIB Module Security
ja: MIB モジュールのセキュリティ

source: In either of those cases, an attacker could construct a packet or packets that could be inserted into an SSH stream.
ja: どちらの場合も, 攻撃者はSSHのストリームに挿入できる1つないし複数のパケットを構成できる.

source: If the overwrite field is true and the specified key already exists, but cannot be overwritten, the server MUST return SSH_PUBLICKEY_ACCESS_DENIED.
ja: overwrite フィールドが true で指定された鍵が存在し, 鍵を上書きできない場合は, サーバは SSH_PUBLICKEY_ACCESS_DENIED を返さなければならない.

source: Public Key Format
ja: 公開鍵の形式

source: Even if the network itself is secure (for example by using IPSec or SSH), even then, there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB module.
ja: (例えば IPSec や SSH を用いて) ネットワーク自体は安全であっても, この MIB モジュールのオブジェクトにアクセスし GET/SET (read/change/create/delete) できる, 安全なネットワーク上のだれかに関しては制御がない.

source: Second Rekeying Recommendation
ja: 鍵の再生成についての2番目の推奨

source: o To improve the chances that a peer can verify certificate chains and OCSP responses, individual certificates and OCSP responses SHOULD be signed using only signature algorithms corresponding to public key algorithms supported by the peer, as indicated in the server_host_key_algorithms field of the SSH_MSG_KEXINIT packet (see Section 7.1 of [RFC4253]).
ja: o ピアがチェーンと OCSP 応答を検証できやすくするため, それぞれの証明書と OCSP 応答は ピアがサポートする公開鍵アルゴリズムに関連する署名アルゴリズムでのみ署名される必要がある. このアルゴリズムは, SSH_MSG_KEXINIT パケット の server_host_key_algorithms ([RFC4253] の 7 .1節)で示される.

source: That is, it may not send another request before the client has answered.
ja: つまり, クライアントが返答する前に別の要求を送ってはならない.

source: The ability to propose new groups will reduce the incentive to use precomputation for more efficient calculation of the discrete logarithm.
ja: 新しい群を提案できると, 離散対数のより効率的な計算のために事前処理をする動機を減らすことができる.

source: If the chunk-size and the chunk-size value respectively are invalid or if an error occurs during the decoding process, the peer MUST terminate the NETCONF session by closing the corresponding SSH channel.
ja: chunk-size と chunk-size の値がそれぞれ不正だったり, デコードの処理でエラーが起きたら, 対応する SSH チャンネルを閉じて NETCONF セッションをピアは終了させなければならない.

source: Connection Protocol Global Request Names
ja: コネクションプロトコルのグローバルなリクエスト名

source: The SSH Transport Model relies on SSH mutual authentication, binding of keys, confidentiality, and integrity.
ja: SSH トランスポートモデルは, SSHの相互認証, 鍵の束縛, 機密性, 完全性に依存する.

source: As a result, mechanisms conforming to this document MUST NOT use SPNEGO as the underlying GSS-API mechanism.
ja: これにより, この文書に従うメカニズムは, 基底のGSS-API メカニズムとして SPENGO を用いてはならない.

source: Represents a 64-bit unsigned integer.
ja: 64-bitの 符号無し整数を表す.

source: 'signal name' values will be encoded as discussed in the passage describing SSH_MSG_CHANNEL_REQUEST messages using "exit-signal" in this section.
ja: 'signal name' の値は, この節の "exit-signal" を用いる SSH_MSG_CHANNEL_REQUEST メッセージを記述している節で議論されているようにエンコードされる.

source: Size of the Authentication Tag .............................6 7.
ja: 認証タグのサイズ .............................6 7.

source: This safeguard prevents an unreasonably long BREAK request from causing a port to become unavailable for as long as 49.7 days while executing the BREAK.
ja: この予防手段は, 理不尽に長い BREAK 要求が BREAKを実行する間に49.7日の間ポートを利用不能にするのを防ぐ.

source: Requirements Terminology
ja: 要件に関する用語

source: Inputs: octet_string PT ; // Plain Text, to be both // authenticated and encrypted octet_string AAD; // Additional Authenticated Data, // authenticated but not encrypted octet_string IV; // Initialization Vector octet_string BK; // Block Cipher Key
ja: Inputs: octet_string PT ; // 認証と暗号化の両方の平文 octet_string AAD; // 追加の認証されるデータ. 認証されるが暗号化されない octet_string IV; // 初期化ベクトル octet_string BK; // ブロック暗号の鍵

source: It may not be possible for the Transport Model to determine when the network is under stress.
ja: ネットワークに負荷がかかっているかどうかトランスポートモデルが判断可能でない場合がある.

source: The "twofish-cbc" or "twofish256-cbc" cipher is Twofish in CBC mode, with 256-bit keys as described [TWOFISH].
ja: "twofish-cbc" もしくは "twofish256-cbc" 暗号は, CBCモードの Twofish で, 256-bitの鍵を使う. [TWOFISH] で記述されている.

source: Service Names
ja: サービス名

source: It is RECOMMENDED that SSH server implementations that support X11 forwarding default to allow the display to open only over local IPC.
ja: X11の転送をサポートするSSHのサーバの実装は, デフォルトではlocalのIPC上でのみディスプレイをオープンすることが推奨される.

source: However, the server MUST NOT ever have more than one SSH_MSG_USERAUTH_INFO_REQUEST message outstanding.
ja: しかし, サーバは, 2つ以上の未処理の SSH_MSG_USERAUTH_INFO_REQUEST メッセージを扱ってはならない..
